<!-- Assignment 1 -->
<!-- Напишете for цикъл, който извежда числа от 1 до 10, разделени с тире, като преди 1 и след 10 не трябва да има тире:
     1-2-3-4-5-6-7-8-9-10 -->

<?php
for($x=1; $x<=10; $x++)
{
 if($x< 10)
 {
 echo "$x-";
 }
 else
  {
 echo "$x"."\n";
  }
}
?>

<br>

<!-- Assignment 2 -->
<!-- Напишете php програмка, която извежда сумата на числата от 0 до 30.
 Използвайте for цикъл и си припомнете математическите оператори 😉

 -->

<?php
$sum = 0;
for($x=1; $x<=30; $x++)
{
$sum +=$x;
}
echo "The sum of the numbers 0 to 30 is $sum"."\n";
?>

<br>

<!-- Assignment 3 -->
<!--  Напишете php програмка, която извежда факториела на  5, 8 и 10. (Факториел
 на число е произведението на всички цели числа от 1 до него, включително. Пример:
  факториел 5 е равен на 1 * 2 * 3 * 4 * 5.) -->

<?php
$n = 5;
$x = 1;
for($i=1;$i<=$n-1;$i++)
{
 $x*=($i+1);
}
echo "The factorial of  $n = $x"."\n";
?>

<br>

<!-- Assignment 4 -->
<!-- Напишете вложени for цикли, които извеждат следното: -->


<?php
for($x=1;$x<=5;$x++)
{
   for ($y=1;$y<=$x;$y++)
    {
	 echo "*";
	    if($y< $x)
		 {
		   echo " ";
		 }
     }
 echo "\n";
}
?>

<br>

<!-- Assignment 5 -->
<!--  Напишете вложени for цикли, които извеждат следното: -->

<?php
$n=5;
for($i=1; $i<=$n; $i++)
{
for($j=1; $j<=$i; $j++)
{
echo ' * ';
}
echo '\n';
}
for($i=$n; $i>=1; $i--)
{
for($j=1; $j<=$i; $j++)
{
echo ' * ';
}
echo '\n ';
}
?>

<br>

<!-- Assignment 6 -->
<!-- Напишете вложени цикли, които извеждат таблицата от прикачения
 файл table.png (в края на условието) -->

<?php
echo "<table border =\"1\" style='border-collapse: collapse'>";
	for ($row=1; $row <= 10; $row++) {
		echo "<tr> \n";
		for ($col=1; $col <= 10; $col++) {
		   $p = $col * $row;
		   echo "<td>$p</td> \n";
		   	}
	  	    echo "</tr>";
		}
		echo "</table>";
?>

<br>

<!-- Assignment 7 -->
<!-- Напишете цикли, които извеждат "триъгълници на Флойд" с 5, 10 и 21 реда.
 Накратко казано, това са ляво подравнени правоъгълни триъгълници от редове с цели числа,
 където всеки ред започва с поредното число и съдържа с едно число повече от предния ред.
    Пример - триъгълник с 5 реда изглежда по следния начин: -->

<?php
$n = 5;
echo "n = " . $n . "\n";
$count = 1;
for ($i = $n; $i > 0; $i--)
{
  for ($j = $i; $j < $n + 1; $j++)
   {
     printf("%4s", $count);
     $count++;
   }
	echo "\n";
   }
?>
